backEnd/app/controllers/characters_controller.rb

UPDATE "characters" SET "description" = ?, "thumbnail" = ?, "updated_at" = ? WHERE "characters"."id" = ?  [["description", "He is Machine Man."], ["thumbnail", "http://www.majorspoilers.com/wp-content/uploads/2010/05/MM1"], ["updated_at", "2018-10-24 16:14:39.588178"], ["id", 4]]
---
  def update
    if @character.update(character_params)

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 6]]
---
  def destroy
    @character = Character.find(params[:id])
    @character.destroy