backEnd/app/controllers/characters_comics_controller.rb

  def index
      @character_comics = CharactersComics.all
---
SELECT "characters_comics".* FROM "characters_comics"