backEnd/app/controllers/comics_controller.rb

SELECT "comics".* FROM "comics"
---
  def index
    @comics = Comic.all

UPDATE "comics" SET "description" = ?, "price" = ?, "updated_at" = ? WHERE "comics"."id" = ?  [["description", "this is the description"], ["price", 8], ["updated_at", "2018-10-23 18:15:10.042678"], ["id", 1]]
---
  def update
    if @comic.update(comic_params)

SELECT  "comics".* FROM "comics" WHERE "comics"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
DELETE FROM "comics" WHERE "comics"."id" = ?  [["id", 20]]
---
  def destroy
    @comic = Comic.find(params[:id])
    @comic.destroy

SELECT  "comics".* FROM "comics" WHERE "comics"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
    def set_comic
      @comic = Comic.find(params[:id])