backEnd/app/controllers/trailers_controller.rb

  def index
    @trailers = Trailer.all
---
SELECT "trailers".* FROM "trailers"